backend/tests/load-testing/dashboard-load-test.yml
config:
  target: "http://localhost:3000"  # ✅ CORRECTED PORT
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm-up"
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp-up"
    - duration: 120
      arrivalRate: 20
      name: "Sustained"
    - duration: 60
      arrivalRate: 30
      name: "Stress"

scenarios:
  - name: "Dashboard Access"
    weight: 100
    flow:
      # Step 1: Login
      - post:
          url: "/api/auth/login"
          json:
            email: "kiran.test@fincopilot.com"
            password: "NewTest@123456"
          capture:
            - json: "$.data.token"
              as: "authToken"
      
      # Step 2: Get Dashboard
      - get:
          url: "/api/dashboard/summary"
          headers:
            Authorization: "Bearer {{ authToken }}"
      
      - think: 3
      
      # Step 3: Get Transactions
      - get:
          url: "/api/transactions?page=1&limit=20"
          headers:
            Authorization: "Bearer {{ authToken }}"
      
      - think: 2
      
      # Step 4: Get Budgets
      - get:
          url: "/api/budgets"
          headers:
            Authorization: "Bearer {{ authToken }}"